[
  {"day":1,"questions":[
    {"text":"I feel like we're good at staying in touch."},
    {"text":"I feel comfortable bringing up something that's bothering me."},
    {"text":"I feel supported when I'm going through a hard time."},
    {"text":"I like how often we talk or see each other."},
    {"text":"I feel like we can be honest with each other without judgment."}
  ]},
  {"day":2,"questions":[
    {"text":"I feel like they really listen when I share something important."},
    {"text":"I'm okay with how much or how little we're involved in each other's daily lives."},
    {"text":"I feel like we respect each other's boundaries."},
    {"text":"I feel appreciated by them."},
    {"text":"I think we handle disagreements in a healthy way."}
  ]},
  {"day":3,"questions":[
    {"text":"I feel like I can be my full self around them."},
    {"text":"I feel like they're there for me when I need them."},
    {"text":"I'm happy with how we celebrate good news together."},
    {"text":"I feel like we're on the same page about what our relationship means."},
    {"text":"I feel like we give each other enough space."}
  ]},
  {"day":4,"questions":[
    {"text":"I feel like they understand what I'm going through."},
    {"text":"I'm comfortable with how we communicate (text, call, in person)."},
    {"text":"I feel like we can talk about both the small stuff and the big stuff."},
    {"text":"I feel like they're proud of me."},
    {"text":"I feel like we're good at reconnecting after time apart."}
  ]},
  {"day":5,"questions":[
    {"text":"I feel like our relationship has gotten stronger over time."},
    {"text":"I feel like I can ask for help when I need it."},
    {"text":"I feel like we're good at giving each other space when we need it."},
    {"text":"I feel like they take my feelings seriously."},
    {"text":"I'm satisfied with how we handle different opinions."}
  ]},
  {"day":6,"questions":[
    {"text":"I feel like we have a good balance of checking in and not smothering."},
    {"text":"I feel like they're someone I can turn to when things are hard."},
    {"text":"I feel like we're aligned on what \"being there\" means for each other."},
    {"text":"I feel like they see me as an adult."},
    {"text":"I feel like we're good at moving past disagreements."}
  ]},
  {"day":7,"questions":[
    {"text":"I feel like they're interested in my life."},
    {"text":"I feel like I can share good news without it being a big deal."},
    {"text":"I feel like we're on the same page about family expectations."},
    {"text":"I feel like they trust my decisions."},
    {"text":"I feel like we make time for each other in a way that works."}
  ]},
  {"day":8,"questions":[
    {"text":"I feel like they give me advice when I want it, not when I don't."},
    {"text":"I feel like we're good at staying connected without it feeling like obligation."},
    {"text":"I feel like they're supportive of my goals."},
    {"text":"I feel like we can have hard conversations when we need to."},
    {"text":"I feel like our relationship is a priority for both of us."}
  ]},
  {"day":9,"questions":[
    {"text":"I feel like they understand when I need space."},
    {"text":"I feel like we're aligned on how often we talk or see each other."},
    {"text":"I feel like they're someone I can be vulnerable with."},
    {"text":"I feel like we're good at celebrating each other's wins."},
    {"text":"I feel like they accept me for who I am."}
  ]},
  {"day":10,"questions":[
    {"text":"I feel like we're good at reading each other's moods."},
    {"text":"I feel like they don't judge me when I make mistakes."},
    {"text":"I feel like we're on the same page about what \"support\" looks like."},
    {"text":"I feel like they're there for me without being overbearing."},
    {"text":"I feel like our relationship adds to my life."}
  ]},
  {"day":11,"questions":[
    {"text":"I feel like we can talk about the future without it being heavy."},
    {"text":"I feel like they respect my independence."},
    {"text":"I feel like we're good at reconnecting after a disagreement."},
    {"text":"I feel like they're curious about my life."},
    {"text":"I feel like we have a good rhythm for staying in touch."}
  ]},
  {"day":12,"questions":[
    {"text":"I feel like they're proud of who I'm becoming."},
    {"text":"I feel like we're aligned on how to handle family stuff."},
    {"text":"I feel like I can tell them when I'm struggling."},
    {"text":"I feel like they give me room to figure things out on my own."},
    {"text":"I feel like we're good at making each other laugh."}
  ]},
  {"day":13,"questions":[
    {"text":"I feel like they're someone I can count on."},
    {"text":"I feel like we're on the same page about boundaries."},
    {"text":"I feel like they're supportive even when they don't agree with my choices."},
    {"text":"I feel like we're good at picking up where we left off."},
    {"text":"I feel like they see the real me."}
  ]},
  {"day":14,"questions":[
    {"text":"I feel like we're good at giving each other the benefit of the doubt."},
    {"text":"I feel like they're there when it matters."},
    {"text":"I feel like we're aligned on what \"being close\" means."},
    {"text":"I feel like they don't pressure me to share more than I want to."},
    {"text":"I feel like our relationship is healthy."}
  ]},
  {"day":15,"questions":[
    {"text":"I feel like they understand that my life is different from theirs."},
    {"text":"I feel like we're good at staying connected without guilt."},
    {"text":"I feel like they're in my corner."},
    {"text":"I feel like we can disagree and still be close."},
    {"text":"I feel like they're happy for me when good things happen."}
  ]},
  {"day":16,"questions":[
    {"text":"I feel like we're on the same page about how much we're in each other's business."},
    {"text":"I feel like they're a safe person to be vulnerable with."},
    {"text":"I feel like we're good at respecting each other's time."},
    {"text":"I feel like they get me."},
    {"text":"I feel like we're aligned on what we expect from each other."}
  ]},
  {"day":17,"questions":[
    {"text":"I feel like they're supportive of my relationships with other people."},
    {"text":"I feel like we're good at knowing when to reach out."},
    {"text":"I feel like they don't hold grudges."},
    {"text":"I feel like we're on the same page about family traditions."},
    {"text":"I feel like they want what's best for me."}
  ]},
  {"day":18,"questions":[
    {"text":"I feel like we can talk about money or practical stuff without it being weird."},
    {"text":"I feel like they're good at reading when I need space vs. when I need connection."},
    {"text":"I feel like we're aligned on how we show up for each other."},
    {"text":"I feel like they accept that I'm still figuring things out."},
    {"text":"I feel like our relationship makes both of us better."}
  ]},
  {"day":19,"questions":[
    {"text":"I feel like they're someone I can call when I don't know what to do."},
    {"text":"I feel like we're good at not taking each other for granted."},
    {"text":"I feel like they're supportive of my career or life path."},
    {"text":"I feel like we can talk about hard topics when we need to."},
    {"text":"I feel like they're one of my people."}
  ]},
  {"day":20,"questions":[
    {"text":"I feel like we're on the same page about holidays and family time."},
    {"text":"I feel like they're good at apologizing when they're wrong."},
    {"text":"I feel like we're good at forgiving each other."},
    {"text":"I feel like they're interested in my opinions."},
    {"text":"I feel like we're aligned on what \"being there\" looks like in practice."}
  ]},
  {"day":21,"questions":[
    {"text":"I feel like they give me room to make my own mistakes."},
    {"text":"I feel like we're good at staying in touch without it feeling like a chore."},
    {"text":"I feel like they're supportive when I'm stressed."},
    {"text":"I feel like we're on the same page about advice (when to give it, when to hold back)."},
    {"text":"I feel like they love me for who I am."}
  ]},
  {"day":22,"questions":[
    {"text":"I feel like we're good at celebrating milestones together."},
    {"text":"I feel like they don't compare me to others."},
    {"text":"I feel like we're aligned on how much we share about our lives."},
    {"text":"I feel like they're someone I can be real with."},
    {"text":"I feel like our relationship is built on trust."}
  ]},
  {"day":23,"questions":[
    {"text":"I feel like they're good at not making everything about them."},
    {"text":"I feel like we're on the same page about what \"family\" means to us."},
    {"text":"I feel like they're there for the small moments, not just the big ones."},
    {"text":"I feel like we're good at giving each other grace."},
    {"text":"I feel like they believe in me."}
  ]},
  {"day":24,"questions":[
    {"text":"I feel like we're good at navigating change together."},
    {"text":"I feel like they respect my decisions even when they'd do differently."},
    {"text":"I feel like we're aligned on how we handle conflict."},
    {"text":"I feel like they're one of the first people I want to tell when something big happens."},
    {"text":"I feel like we're in a good place."}
  ]},
  {"day":25,"questions":[
    {"text":"I feel like they're good at knowing when to push and when to back off."},
    {"text":"I feel like we're on the same page about staying in touch when life gets busy."},
    {"text":"I feel like they're supportive of my friendships."},
    {"text":"I feel like we can talk about the past without it being loaded."},
    {"text":"I feel like they're someone I want in my life for the long haul."}
  ]},
  {"day":26,"questions":[
    {"text":"I feel like we're good at making time for each other."},
    {"text":"I feel like they don't guilt me when I'm busy or distant."},
    {"text":"I feel like we're aligned on what we need from each other."},
    {"text":"I feel like they're someone I can count on in a crisis."},
    {"text":"I feel like our relationship has room to grow."}
  ]},
  {"day":27,"questions":[
    {"text":"I feel like they're good at listening without always trying to fix things."},
    {"text":"I feel like we're on the same page about how we show love."},
    {"text":"I feel like they're supportive when I'm trying something new."},
    {"text":"I feel like we can be honest without hurting each other."},
    {"text":"I feel like they're in my corner no matter what."}
  ]},
  {"day":28,"questions":[
    {"text":"I feel like we're good at respecting each other's boundaries."},
    {"text":"I feel like they're proud of me even when I'm not \"succeeding.\""},
    {"text":"I feel like we're aligned on what \"being close\" looks like at this stage of life."},
    {"text":"I feel like they're someone I can be silly with."},
    {"text":"I feel like our relationship is a source of strength for me."}
  ]},
  {"day":29,"questions":[
    {"text":"I feel like they're good at giving me space to grow."},
    {"text":"I feel like we're on the same page about checking in."},
    {"text":"I feel like they're supportive when I'm going through something hard."},
    {"text":"I feel like we can disagree without it damaging our relationship."},
    {"text":"I feel like they see the best in me."}
  ]},
  {"day":30,"questions":[
    {"text":"I feel like we're good at staying connected through life's changes."},
    {"text":"I feel like they're someone I can be fully myself with."},
    {"text":"I feel like we're aligned on what we mean to each other."},
    {"text":"I feel like they're there for me in the way I need."},
    {"text":"I feel grateful for our relationship."}
  ]}
]
